'''
Думаю все помнят как играть в города.

Называют один город, потом надо назвать город,
начинающийся с последней буквы названия предыдущего и так далее, пока города не кончатся.
Надо написать программу, которая из набора названий городов (все названия разные) строит цепочку максимальной длины. Запрещено повторять название городов.

Города пользователь вводит одним действием в виде строки, где города разделены пробелами.
'''
#  Алгоритм сортировки городов по первой букве названия
#  Сортировка выполняется реверсивно, т.е. последний элемент массива передается в начало массива




