string = input()

#print(string.replace('n', 'N'))


# Пользователь вводит строку текста.
# Замените в этой строке все буквы 'n' на 'N', кроме первого и последнего слова в предложении.
# Считаем, что первое и последнее слово от остальных слов отделены пробелом.
# Понадобятся срезы (slice, str[:]) и метод str.replace.
